Repository: Ulugbek0402/imtihon
Catalog: locale/*/LC_MESSAGES/django.po
Languages: uz

source: English
uz: Inglizcha

source: Uzbek
uz: O'zbekcha

source: Russian
uz: Ruscha

source: Password
uz: Parol

source: Unable to log in with provided credentials.
uz: Berilgan ma'lumotlar bilan tizimga kirib bo'lmadi.

source: Must include "email" and "password".
uz: "Email" va "parol" kiritilishi shart.

source: Auto: %(category)s
uz: Avto: %(category)s

source: Goal: %(title)s
uz: Maqsad: %(title)s

source: User
uz: Foydalanuvchi

source: Name
uz: Nomi

source: Balance
uz: Balans

source: Currency
uz: Valyuta

source: Account
uz: Hisob

source: Amount
uz: Miqdor

source: Type
uz: Turi

source: Category
uz: Kategoriya

source: Code
uz: Kod

source: Rate
uz: Kurs

source: Title
uz: Sarlavha

source: Target
uz: Maqsad

source: Current
uz: Joriy

source: Super Control
uz: Super Boshqaruv

source: Welcome
uz: Xush kelibsiz

source: Today you can manage all financial operations in the system.
uz: Bugun siz tizimdagi barcha moliyaviy amallarni boshqarishingiz mumkin.

source: FinanceHome | Admin Dashboard
uz: FinanceHome | Admin Paneli

source: Dashboard
uz: Boshqaruv Paneli

source: Language
uz: Til

source: Logout
uz: Chiqish

source: Admin Control Center
uz: Admin Boshqaruv Markazi

source: Manage system data & users
uz: Tizim ma'lumotlari va foydalanuvchilarni boshqarish

source: System Active
uz: Tizim Faol

source: Total Users
uz: Jami Foydalanuvchilar

source: Active Accounts
uz: Faol Hisoblar

source: Transactions
uz: Tranzaksiyalar

source: Database Management
uz: Ma'lumotlar Bazasini Boshqarish

source: Accounts
uz: Hisoblar

source: Currencies
uz: Valyutalar

source: Goals
uz: Maqsadlar

source: User List
uz: Foydalanuvchilar Ro'yxati

source: ACCOUNTS
uz: HISOBLAR

source: JOINED
uz: QO'SHILDI

source: ACTION
uz: AMAL

source: Delete user
uz: O'chirish

source: Back to Dashboard
uz: Panelga qaytish

source: All Records
uz: Barcha yozuvlar

source: Total
uz: Jami

source: INCOME
uz: DAROMAD

source: EXPENSE
uz: XARAJAT

source: No data available yet
uz: Ma'lumot mavjud emas

source: Budget History | FinanceHome
uz: Byudjet Tarixi | FinanceHome

source: Budgets
uz: Byudjetlar

source: Budget History
uz: Byudjet Tarixi

source: Spent
uz: Ishlatildi

source: DATE
uz: SANA

source: ACCOUNT
uz: HISOB

source: AMOUNT
uz: MIQDOR

source: No expenses for this budget yet.
uz: Ushbu byudjet uchun hali xarajatlar yo'q.

source: No budgets found. Create one in Dashboard!
uz: Byudjet topilmadi. Panelda yangisini yarating!

source: Change Password | FinanceHome
uz: Parolni O'zgartirish | FinanceHome

source: Change Password
uz: Parolni o'zgartirish

source: Secure your account by updating your credentials
uz: Hisobingizni xavfsizligini ta'minlash uchun parolni yangilang

source: Update Password
uz: Parolni yangilash

source: Reset Password
uz: Parolni tiklash

source: Enter your email and we'll send a 6-digit verification code.
uz: Emailingizni kiriting va biz 6 xonali tasdiqlash kodini yuboramiz.

source: Email Address
uz: Email Manzili

source: Enter your email
uz: Emailingizni kiriting

source: Send Code
uz: Kod yuborish

source: Back to Login
uz: Kirish sahifasiga qaytish

source: Goals History | FinanceHome
uz: Maqsadlar Tarixi | FinanceHome

source: Goals History
uz: Maqsadlar Tarixi

source: Savings History
uz: Jamg'armalar Tarixi

source: Track all your contributions towards your financial goals
uz: Moliyaviy maqsadlaringizga qo'shilgan barcha hissalarni kuzatib boring

source: Date
uz: Sana

source: From Account
uz: Hisobdan

source: Goal Name
uz: Maqsad Nomi

source: Amount Contributed
uz: Qo'shilgan Miqdor

source: No goal contributions found yet.
uz: Hali maqsadlar uchun hissalar topilmadi.

source: Transactions | FinanceHome
uz: Tranzaksiyalar | FinanceHome

source: Security
uz: Xavfsizlik

source: Transaction History
uz: Tranzaksiyalar Tarixi

source: Review your past incomes and expenses
uz: O'tgan daromad va xarajatlaringizni ko'zdan kechiring

source: Incomes
uz: Daromadlar

source: Expenses
uz: Xarajatlar

source: All Types
uz: Barcha turlar

source: All Transactions
uz: Barcha tranzaksiyalar

source: Incomes Only
uz: Faqat daromadlar

source: Expenses Only
uz: Faqat xarajatlar

source: Date & Time
uz: Sana va Vaqt

source: No transactions found for this filter.
uz: Ushbu filtr bo'yicha tranzaksiyalar topilmadi.

source: FinanceHome | Smart Dashboard
uz: FinanceHome | Smart Panel

source: Smart Dashboard
uz: Smart Panel

source: Manage your wealth and spending habits
uz: Boyligingiz va xarajat odatlaringizni boshqaring

source: Goal
uz: Maqsad

source: Budget
uz: Byudjet

source: Transaction
uz: Tranzaksiya

source: Total Net Worth
uz: Umumiy Mablag'

source: Spending Analysis
uz: Xarajatlar Tahlili

source: My Accounts
uz: Mening Hisoblarim

source: accounts
uz: hisoblar

source: Current Balance
uz: Joriy Balans

source: No accounts found. Add a new account.
uz: Hisob topilmadi. Yangi hisob qo'shing.

source: Monthly Budgets
uz: Oylik Byudjetlar

source: View All
uz: Hammasini ko'rish

source: No active budgets
uz: Faol byudjetlar yo'q

source: Saving Goals
uz: Jamg'arma Maqsadlari

source: Contribute
uz: Hissa qo'shish

source: No goals yet
uz: Hali maqsadlar yo'q

source: New Goal
uz: Yangi Maqsad

source: Target Amount
uz: Maqsadli Summa

source: Add Goal
uz: Maqsad qo'shish

source: Set Budget Plan
uz: Byudjet Rejasini Tuzish

source: Budget Type
uz: Byudjet Turi

source: Monthly
uz: Oylik

source: Stipend
uz: Stipendiya

source: Other
uz: Boshqa

source: Limit Amount
uz: Limit Miqdori

source: Set Budget
uz: Byudjetni belgilash

source: Connect Account
uz: Hisobni Ulash

source: Account Name
uz: Hisob Nomi

source: Add Account
uz: Hisob qo'shish

source: New Transaction
uz: Yangi Tranzaksiya

source: Expense
uz: Xarajat

source: Income
uz: Daromad

source: Save
uz: Saqlash

source: Contribute to Goal
uz: Maqsadga hissa qo'shish

source: Select Goal
uz: Maqsadni tanlang

source: Transfer Savings
uz: Jamg'armani o'tkazish

source: FinanceHome | Sign In
uz: FinanceHome | Tizimga Kirish

source: Welcome Back
uz: Xush kelibsiz

source: Manage your wealth smarter.
uz: Mablag'ingizni aqlli boshqaring.

source: Forgot?
uz: Unutdingizmi?

source: Sign In
uz: Kirish

source: Don't have an account?
uz: Hisobingiz yo'qmi?

source: Sign Up
uz: Ro'yxatdan o'tish

source: Create Account | FinanceHome
uz: Hisob Yaratish | FinanceHome

source: Join Us Today!
uz: Bizga bugun qo'shiling!

source: Start managing your wealth smarter.
uz: Mablag'ingizni aqlli boshqarishni boshlang.

source: Confirm Password
uz: Parolni tasdiqlang

source: Passwords do not match!
uz: Parollar mos kelmadi!

source: Create Account
uz: Hisob yaratish

source: Already have an account?
uz: Hisobingiz bormi?

source: Verify Code | FinanceHome
uz: Kodni Tasdiqlash | FinanceHome

source: Verify Code
uz: Kodni tasdiqlash

source: Enter the 6-digit code sent to your email. You have 2 minutes.
uz: Emailingizga yuborilgan 6 xonali kodni kiriting. Sizda 2 daqiqa vaqt bor.

source: Verification Code
uz: Tasdiqlash kodi

source: New Password
uz: Yangi Parol

source: Enter new password
uz: Yangi parolni kiriting
